docker_exp/docker_test/container/stress_10000_256.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_256.txt
Document Length:        214 bytes

Concurrency Level:      100
Time taken for tests:   1.758 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3920000 bytes
HTML transferred:       2140000 bytes
Requests per second:    5687.25 [#/sec] (mean)
Time per request:       17.583 [ms] (mean)
Time per request:       0.176 [ms] (mean, across all concurrent requests)
Transfer rate:          2177.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     2   17  10.9     15     105
Waiting:        2   17  10.8     15     105
Total:          2   17  10.9     15     105

Percentage of the requests served within a certain time (ms)
  50%     15
  66%     18
  75%     21
  80%     23
  90%     29
  95%     37
  98%     52
  99%     60
 100%    105 (longest request)