docker_exp/docker_test/container/stress_10000_4.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.0.20 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.0.20
Server Port:            8090

Document Path:          /OS_ORDER_4.txt
Document Length:        212 bytes

Concurrency Level:      100
Time taken for tests:   1.794 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3900000 bytes
HTML transferred:       2120000 bytes
Requests per second:    5574.14 [#/sec] (mean)
Time per request:       17.940 [ms] (mean)
Time per request:       0.179 [ms] (mean, across all concurrent requests)
Transfer rate:          2122.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     2   17   7.9     16      62
Waiting:        1   17   7.8     15      62
Total:          2   18   7.8     16      63

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     19
  75%     22
  80%     23
  90%     28
  95%     33
  98%     37
  99%     42
 100%     63 (longest request)